Project/Toir/src/Documents/торо_ВводНачальныхДанных/торо_ВводНачальныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВводНачальныхДанных</name>
  <registerRecords>InformationRegister.торо_ТекущееСостояниеОР</registerRecords>
  <registerRecords>AccumulationRegister.торо_НаработкаОбъектовРемонта</registerRecords>
  <registerRecords>AccumulationRegister.торо_КоличествоПусковОР</registerRecords>
  <registerRecords>InformationRegister.торо_ПериодыНаработкиОР</registerRecords>
  <registerRecords>InformationRegister.торо_ЗначенияКонтролируемыхПоказателей</registerRecords>
  <registerRecords>InformationRegister.торо_ЗавершенныеМероприятия</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОстановленноеОборудование</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОборудованиеНаИспытаниях</registerRecords>
  <registerRecords>InformationRegister.торо_ЗавершенныеРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_ИсторияЗапчастейОбъектаРемонта</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыДокументаВводНачДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ремонты</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Ремонт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнегоРемонта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаПриРемонте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееСостояние</name>
      <type>
        <types>CatalogRef.торо_ВидыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаПростоя</name>
      <type>
        <types>CatalogRef.торо_ПричиныПростояОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзменятьСостояниеПодчиненныхОР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаработкаОбъектыРемонта</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыС</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыПо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиОбъектыРемонта</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтроля</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапчастиОбъектаРемонта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДвиженияЗЧ</name>
      <type>
        <types>EnumRef.торо_ВидыДвиженияСерийныхЗЧ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РегламентныеМероприятия</name>
    <attributes>
      <name>СписокОбъектов</name>
      <type>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМероприятия</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнегоМероприятия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СпискиОбъектовРемонта</name>
    <attributes>
      <name>СписокОбъектов</name>
      <type>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПускиОР</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПуска</name>
      <type>
        <types>CatalogRef.торо_ВидыПусковОР</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_ЗначенияКонтролируемыхПоказателей/торо_ЗначенияКонтролируемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗначенияКонтролируемыхПоказателей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ИсторияЗапчастейОбъектаРемонта/торо_ИсторияЗапчастейОбъектаРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИсторияЗапчастейОбъектаРемонта</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьРесурс</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Запчасть</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДвиженияЗЧ</name>
    <type>
      <types>EnumRef.торо_ВидыДвиженияСерийныхЗЧ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Установлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/AccumulationRegisters/торо_КоличествоПусковОР/торо_КоличествоПусковОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_КоличествоПусковОР</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПуска</name>
    <type>
      <types>CatalogRef.торо_ВидыПусковОР</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/InformationRegisters/торо_ТекущееСостояниеОР/торо_ТекущееСостояниеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ТекущееСостояниеОР</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидЭксплуатации</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаПростоя</name>
    <type>
      <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/AccumulationRegisters/торо_ОстановленноеОборудование/торо_ОстановленноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ОстановленноеОборудование</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПростоя</name>
    <type>
      <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/AccumulationRegisters/торо_ОборудованиеНаИспытаниях/торо_ОборудованиеНаИспытаниях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ОборудованиеНаИспытаниях</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/InformationRegisters/торо_ЗавершенныеМероприятия/торо_ЗавершенныеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗавершенныеМероприятия</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ВидыДокументаВводНачДанных/торо_ВидыДокументаВводНачДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыДокументаВводНачДанных</name>
  <enumValues>
    <name>ПоОбъектуРемонта</name>
  </enumValues>
  <enumValues>
    <name>ПоСпискуОбъектовРемонта</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_ВводНачальныхДанных/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

Перем мТаблицаОбъектовРемонта;
Перем ТаблицаПодчиненных;

Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.торо_ВидыДокументаВводНачДанных.ПоОбъектуРемонта Тогда
		ПроверяемыеРеквизиты.Добавить("ОбъектыРемонта");
	Иначе
		ПроверяемыеРеквизиты.Добавить("СпискиОбъектовРемонта");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПолучитьТаблицуОбъектовРемонта();
	ПроверитьНаНаличиеДокументовМеняющихСостоянияОР(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.торо_ВидыДокументаВводНачДанных.ПоОбъектуРемонта Тогда
		
		ТЧВыполненныеРаботы = ПолучитьУжеЗаписанныеРаботы();
		ТЧВыполненныеРаботы.Индексы.Добавить("ОбъектРемонта, ВидРемонтныхРабот, ДатаОкончания");
		
		Для каждого Работа Из ВыполненныеРаботы Цикл
			СтруктураПоиска = Новый Структура();
			СтруктураПоиска.Вставить("ОбъектРемонта", Работа.ОбъектРемонта);
			СтруктураПоиска.Вставить("ВидРемонтныхРабот", Работа.ВидРемонтныхРабот);
			СтруктураПоиска.Вставить("ДатаОкончания", Работа.ДатаОкончанияРемонта);
			НайденныеРаботы = ТЧВыполненныеРаботы.НайтиСтроки(СтруктураПоиска);
			Если НайденныеРаботы.Количество() > 0 Тогда
				ШаблонСообщения = НСтр("es='Para el objeto de la reparación ""%1"" en otro documento son anotados ya los datos por la forma los trabajos de reparación ""%2"". ¡La realización es imposible!';ru='Для объекта ремонта ""%1"" в другом документе уже записаны данные по виду ремонтных работ ""%2"". Проведение невозможно!';en='For the repair object ""%1"", another document already contains data on the type of repair work ""%2"". Conducting is impossible!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Работа.ОбъектРемонта, Работа.ВидРемонтныхРабот);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		ТЧВыполненныеМероприятия = ПолучитьУжеЗаписанныеМероприятия();
		ТЧВыполненныеМероприятия.Индексы.Добавить("СписокОбъектов, ВидМероприятия, ДатаОкончания");
		
		Для каждого Мероприятие Из РегламентныеМероприятия Цикл 
			СтруктураПоиска = Новый Структура();
			СтруктураПоиска.Вставить("СписокОбъектов", Мероприятие.СписокОбъектов);
			СтруктураПоиска.Вставить("ВидМероприятия", Мероприятие.ВидМероприятия);
			СтруктураПоиска.Вставить("ДатаОкончания", Мероприятие.ДатаПоследнегоМероприятия);
			НайденныеМероприятия = ТЧВыполненныеМероприятия.НайтиСтроки(СтруктураПоиска);
			Если НайденныеМероприятия.Количество() > 0 Тогда 
				ШаблонСообщения = НСтр("es='Para la lista de los objetos de la reparación ""%1"" en otro documento son anotadas ya las medidas dadas por la forma ""%2"". ¡La realización es imposible!';ru='Для списка объектов ремонта ""%1"" в другом документе уже записаны данные по виду мероприятия ""%2"". Проведение невозможно!';en='For the list of repair objects ""%1"", another document already contains data for the type of activity ""%2"". Conducting is impossible!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Мероприятие.СписокОбъектов, Мероприятие.ВидМероприятия);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				Возврат;
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Показатели.ОбъектРемонта КАК ОбъектРемонта,
		|	Показатели.Показатель КАК Показатель,
		|	Показатели.ДатаКонтроля КАК ДатаКонтроля
		|ПОМЕСТИТЬ ВТ_ПоказателиДокумента
		|ИЗ
		|	&Показатели КАК Показатели
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ЗначенияКонтролируемыхПоказателей.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ЗначенияКонтролируемыхПоказателей.Показатель КАК Показатель,
		|	торо_ЗначенияКонтролируемыхПоказателей.ДатаКонтроля КАК ДатаКонтроля,
		|	КОЛИЧЕСТВО(торо_ЗначенияКонтролируемыхПоказателей.Значение) КАК Значение
		|ИЗ
		|	РегистрСведений.торо_ЗначенияКонтролируемыхПоказателей КАК торо_ЗначенияКонтролируемыхПоказателей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоказателиДокумента КАК ПоказателиДокумента
		|		ПО торо_ЗначенияКонтролируемыхПоказателей.ОбъектРемонта = ПоказателиДокумента.ОбъектРемонта
		|			И торо_ЗначенияКонтролируемыхПоказателей.Показатель = ПоказателиДокумента.Показатель
		|			И торо_ЗначенияКонтролируемыхПоказателей.ДатаКонтроля = ПоказателиДокумента.ДатаКонтроля
		|			И НЕ торо_ЗначенияКонтролируемыхПоказателей.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_ЗначенияКонтролируемыхПоказателей.ОбъектРемонта,
		|	торо_ЗначенияКонтролируемыхПоказателей.Показатель,
		|	торо_ЗначенияКонтролируемыхПоказателей.ДатаКонтроля
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(торо_ЗначенияКонтролируемыхПоказателей.Значение) > 0
		|";
	
	Запрос.УстановитьПараметр("Показатели", ПоказателиОбъектыРемонта);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" a la fecha del control ""%2"" es indicado ya el significado del índice ""%3""!';ru='Для объекта ремонта ""%1"" на дату контроля ""%2"" уже указано значение показателя ""%3""!';en='For the repair object ""%1"", the value of the indicator ""%3"" is already indicated on the inspection date ""%2!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаДетальныеЗаписи.ОбъектРемонта, ВыборкаДетальныеЗаписи.ДатаКонтроля, ВыборкаДетальныеЗаписи.Показатель);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЦикла;
		
		Возврат;
	КонецЕсли; 
	
	Движения.торо_ЗавершенныеРемонтныеРаботы.Записывать = Истина;
	Для Каждого Работа Из ВыполненныеРаботы Цикл 
		Движение = Движения.торо_ЗавершенныеРемонтныеРаботы.Добавить();
		Движение.ВидРемонтныхРабот = Работа.ВидРемонтныхРабот;
		Движение.ОбъектРемонта = Работа.ОбъектРемонта;
		Движение.Период = Работа.ДатаОкончанияРемонта;
		Движение.ID = Новый УникальныйИдентификатор;
		Движение.ДатаОкончания = Работа.ДатаОкончанияРемонта;
	КонецЦикла;
	
	Движения.торо_ЗначенияКонтролируемыхПоказателей.Записывать = Истина;
	Для Каждого Показатель Из ПоказателиОбъектыРемонта Цикл 
		Движение=Движения.торо_ЗначенияКонтролируемыхПоказателей.Добавить();
		Движение.ДатаКонтроля = Показатель.ДатаКонтроля;
		Движение.Значение = Показатель.Значение;
		Движение.ОбъектРемонта = Показатель.ОбъектРемонта;
		Движение.Показатель = Показатель.Показатель;
		Движение.Период = Дата;
	КонецЦикла;
	
	Движения.торо_ИсторияЗапчастейОбъектаРемонта.Записывать = Истина;
	Для каждого Запчасть из ЗапчастиОбъектаРемонта Цикл
		Движение=Движения.торо_ИсторияЗапчастейОбъектаРемонта.Добавить();
		Движение.Запчасть = Запчасть.Номенклатура;
		Движение.ОбъектРемонта = Запчасть.ОбъектРемонта;
		Движение.СерийныйНомер = Запчасть.СерийныйНомер;
		Движение.Период = Дата;
		Движение.Количество = ?(ЗначениеЗаполнено(Запчасть.Количество) И Не ЗначениеЗаполнено(Запчасть.СерийныйНомер) ,Запчасть.Количество,1);
		Движение.СтатусДвиженияЗЧ = Запчасть.СтатусДвиженияЗЧ;
		Движение.Установлена = Истина;
	КонецЦикла;
	
	Движения.торо_КоличествоПусковОР.Записывать = Истина;
	Для каждого Пуск из ПускиОР Цикл
		Движение=Движения.торо_КоличествоПусковОР.Добавить();
		Движение.ОбъектРемонта = Пуск.ОбъектРемонта;
		Движение.ВидПуска = Пуск.ВидПуска;
		Движение.Количество = Пуск.Количество;
		Движение.Период = Дата;
	КонецЦикла;
	
	Движения.торо_ТекущееСостояниеОР.Записывать = Истина;
	Движения.торо_ОстановленноеОборудование.Записывать = Истина;
	Движения.торо_ОборудованиеНаИспытаниях.Записывать = Истина;
	Для каждого ОбъектРемонта из мТаблицаОбъектовРемонта Цикл
		Если Не ОбъектРемонта.ОбъектРемонта.ЭтоГруппа Тогда
			Если ЗначениеЗаполнено(ОбъектРемонта.ТекущееСостояние) Тогда
				Движение=Движения.торо_ТекущееСостояниеОР.Добавить();
				Движение.ОбъектРемонта = ОбъектРемонта.ОбъектРемонта;
				Движение.ВидЭксплуатации = ОбъектРемонта.ТекущееСостояние;
				Движение.ПричинаПростоя = ОбъектРемонта.ПричинаПростоя;
				Движение.Период = ОбъектРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию;
				
				Если ОбъектРемонта.ТекущееСостояние.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Простой Тогда
					Движение=Движения.торо_ОстановленноеОборудование.Добавить();
					Движение.ОбъектРемонта 	= ОбъектРемонта.ОбъектРемонта;
					Движение.Количество 	= 1;
					Движение.Дата 			= ОбъектРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию;
					Движение.ПричинаПростоя = ОбъектРемонта.ПричинаПростоя;
					Движение.Период 		= ОбъектРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию;
					Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
				ИначеЕсли ОбъектРемонта.ТекущееСостояние.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Испытания Тогда
					Движение=Движения.торо_ОборудованиеНаИспытаниях.Добавить();
					Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
					Движение.ОбъектРемонта	= ОбъектРемонта.ОбъектРемонта;
					Движение.Период			= ОбъектРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию;
					Движение.Количество		= 1;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	ЗаписьВРегистрыНаработки();
	
	// регламентные мероприятия +
	Движения.торо_ЗавершенныеМероприятия.Записывать = Истина;
	Для Каждого Работа Из РегламентныеМероприятия Цикл 
		Движение = Движения.торо_ЗавершенныеМероприятия.Добавить();
		Движение.СписокОбъектов = Работа.СписокОбъектов;
		Движение.ВидМероприятия = Работа.ВидМероприятия;
		Движение.Период = Работа.ДатаПоследнегоМероприятия;
		Движение.ID = Новый УникальныйИдентификатор;
		Движение.ДатаОкончания = Работа.ДатаПоследнегоМероприятия;
	КонецЦикла;
	// регламентные мероприятия -
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписьВРегистрыНаработки()
	
	Движения.торо_НаработкаОбъектовРемонта.Записывать = Истина;
	Движения.торо_ПериодыНаработкиОР.Записывать = Истина;
	Для Каждого Наработка Из НаработкаОбъектыРемонта Цикл 
		Движение = Движения.торо_НаработкаОбъектовРемонта.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ДатаКон = Наработка.ДатаРаботыПо;
		Движение.ДатаНач = Наработка.ДатаРаботыС;
		Движение.Наработка = Наработка.Значение;
		Движение.ОбъектРемонта = Наработка.ОбъектРемонта;
		Движение.Показатель = Наработка.Показатель;
		Движение.Период = Наработка.ДатаРаботыПо;
		
		Движение = Движения.торо_ПериодыНаработкиОР.Добавить();
		Движение.Период = Наработка.ДатаРаботыПо;
		Движение.ОбъектРемонта = Наработка.ОбъектРемонта;
		Движение.Показатель = Наработка.Показатель;
		
		НайденныеСтроки = ТаблицаПодчиненных.НайтиСтроки(Новый Структура("РодительИерархии", Наработка.ОбъектРемонта));
		Для каждого Строка Из НайденныеСтроки Цикл
			ВОбъектахРемонта = ОбъектыРемонта.НайтиСтроки(Новый Структура("ОбъектРемонта", Строка.ОбъектИерархии));
			Если ВОбъектахРемонта.Количество() = 0 Тогда
				Движение = Движения.торо_НаработкаОбъектовРемонта.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.ДатаКон = Наработка.ДатаРаботыПо;
				Движение.ДатаНач = Наработка.ДатаРаботыС;
				Движение.Наработка = Наработка.Значение;
				Движение.ОбъектРемонта = Строка.ОбъектИерархии;
				Движение.Показатель = Наработка.Показатель;
				Движение.Период = Наработка.ДатаРаботыПо;
				
				Движение = Движения.торо_ПериодыНаработкиОР.Добавить();
				Движение.Период = Наработка.ДатаРаботыПо;
				Движение.ОбъектРемонта = Строка.ОбъектИерархии;
				Движение.Показатель = Наработка.Показатель;				
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьТаблицуОбъектовРемонта()
	
	мТаблицаОбъектовРемонта.Очистить();
	ТаблицаПодчиненных.Очистить();
	
	Для каждого ТекСтрока из ОбъектыРемонта Цикл
		
		СтруктураПоиска = Новый Структура();
		
		СтруктураПоиска.Вставить("ОбъектРемонта",			ТекСтрока.ОбъектРемонта);
		
		НайденныеСтроки = мТаблицаОбъектовРемонта.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			мТаблицаОбъектовРемонта.Удалить(НайденнаяСтрока);
		КонецЦикла;		
		
		Если НЕ ТекСтрока.ИзменятьСостояниеПодчиненныхОР Тогда
			НоваяСтрока = мТаблицаОбъектовРемонта.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		Иначе
						
			НоваяСтрока = мТаблицаОбъектовРемонта.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			
			МассивПодчиненных = торо_РаботаСИерархией20.ПолучитьМассивПодчиненныхОбъектов(ТекСтрока.ОбъектРемонта, ТекСтрока.Иерархия);
			
			Для Каждого ПодчиненныйОР Из МассивПодчиненных Цикл
				НоваяСтрока = ТаблицаПодчиненных.Добавить();
				НоваяСтрока.РодительИерархии = ТекСтрока.ОбъектРемонта;
				НоваяСтрока.ОбъектИерархии = ПодчиненныйОР;
				
				СтруктураПоиска = Новый Структура();
				СтруктураПоиска.Вставить("ОбъектРемонта", ПодчиненныйОР);
				
				Если мТаблицаОбъектовРемонта.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
					НоваяСтрока = мТаблицаОбъектовРемонта.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
					НоваяСтрока.ОбъектРемонта = ПодчиненныйОР;
				КонецЕсли;	
			КонецЦикла;	
 				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаНаличиеДокументовМеняющихСостоянияОР(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбъектыРемонта.ОбъектРемонта,
	               |	ОбъектыРемонта.ТекущееСостояние
	               |ПОМЕСТИТЬ ОбъектыРемонта
	               |ИЗ
	               |	&ОбъектыРемонта КАК ОбъектыРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Состояния.ОбъектРемонта,
	               |	Состояния.ТекущееСостояние
	               |ИЗ
	               |	ОбъектыРемонта КАК Состояния
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
	               |		ПО Состояния.ОбъектРемонта = торо_ТекущееСостояниеОР.ОбъектРемонта
	               |ГДЕ
	               |	торо_ТекущееСостояниеОР.Регистратор <> &Ссылка";
	Запрос.УстановитьПараметр("ОбъектыРемонта", мТаблицаОбъектовРемонта);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ТаблицаНеверныхСтрокТЧ = Запрос.Выполнить().Выгрузить();
	ТаблицаНеверныхСтрокТЧ.Свернуть("ОбъектРемонта, ТекущееСостояние");
	
	Если ТаблицаНеверныхСтрокТЧ.Количество() > 0 Тогда

		Для Каждого Строка Из ТаблицаНеверныхСтрокТЧ Цикл
			Если ЗначениеЗаполнено(Строка.ТекущееСостояние) Тогда
				ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación %1 hay ya unos documentos los estados que cambian del objeto!';ru='Для объекта ремонта %1 уже имеются документы меняющие состояния объекта!';en='For repair object%1, there are already documents that change the state of the object!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.ОбъектРемонта);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
		КонецЦикла;
						
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьУжеЗаписанныеРаботы()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ЗавершенныеРемонтныеРаботы.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_ЗавершенныеРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания КАК ДатаОкончания,
	               |	торо_ЗавершенныеРемонтныеРаботы.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
	               |ГДЕ
	               |	торо_ЗавершенныеРемонтныеРаботы.ОбъектРемонта В(&ОбъектыРемонта)
	               |	И ТИПЗНАЧЕНИЯ(торо_ЗавершенныеРемонтныеРаботы.Регистратор) = ТИП(Документ.торо_ВводНачальныхДанных)
	               |	И НЕ торо_ЗавершенныеРемонтныеРаботы.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("ОбъектыРемонта", ОбъектыРемонта.Выгрузить(, "ОбъектРемонта"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;	
	
КонецФункции

Функция ПолучитьУжеЗаписанныеМероприятия() 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ЗавершенныеМероприятия.СписокОбъектов КАК СписокОбъектов,
	               |	торо_ЗавершенныеМероприятия.ВидМероприятия КАК ВидМероприятия,
	               |	торо_ЗавершенныеМероприятия.ДатаОкончания КАК ДатаОкончания
	               |ИЗ
	               |	РегистрСведений.торо_ЗавершенныеМероприятия КАК торо_ЗавершенныеМероприятия
	               |ГДЕ
	               |	торо_ЗавершенныеМероприятия.СписокОбъектов В(&СпискиОбъектовРемонта)
	               |	И ТИПЗНАЧЕНИЯ(торо_ЗавершенныеМероприятия.Регистратор) = ТИП(Документ.торо_ВводНачальныхДанных)
	               |	И НЕ торо_ЗавершенныеМероприятия.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("СпискиОбъектовРемонта", СпискиОбъектовРемонта.Выгрузить(, "СписокОбъектов"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
	
КонецФункции

мТаблицаОбъектовРемонта = ОбъектыРемонта.ВыгрузитьКолонки();

ТаблицаПодчиненных = Новый ТаблицаЗначений;
ТаблицаПодчиненных.Колонки.Добавить("ОбъектИерархии");
ТаблицаПодчиненных.Колонки.Добавить("РодительИерархии");
ТаблицаПодчиненных.Индексы.Добавить("РодительИерархии");

#КонецОбласти

#КонецЕсли
